Данный код представляет собой программу, которая взаимодействует с двумя внешними сервисами: социальной сетью ВКонтакте (ВК) и облачным хранилищем Яндекс.Диск. Основной функционал заключается в том, чтобы скачать фотографии определенного пользователя из ВКонтакте и загрузить их на Яндекс.Диск.

Задание:

Нужно написать программу, которая будет:
Получать фотографии с профиля. Для этого нужно использовать метод photos.get.
Сохранять фотографии максимального размера(ширина/высота в пикселях) на Я.Диске.
Для имени фотографий использовать количество лайков.
Сохранять информацию по фотографиям в json-файл с результатами.

Входные данные:
Пользователь вводит:
id пользователя vk;

Выходные данные:
json-файл с информацией по файлу:
    [{
    "file_name": "34.jpg",
    "size": "z"
    }]
Измененный Я.диск, куда добавились фотографии.​​

Обязательные требования к программе:

Использовать REST API Я.Диска и ключ, полученный с полигона.
Для загруженных фотографий нужно создать свою папку.
Сохранять указанное количество фотографий(по умолчанию 5) наибольшего размера (ширина/высота в пикселях) на Я.Диске
Сделать прогресс-бар для отслеживания процесса программы.
Код программы должен удовлетворять PEP8.
У программы должен быть свой отдельный репозиторий.
Все зависимости должны быть указаны в файле requiremеnts.txt.​

Доработка замечаний №1
вашу работу необходимо немного доработать, а именно:

Не создается папка на диске. Используется неверная ссылка.

Согласно условию задания, при одинаковом количестве лайков, к имени должна добавляться дата. Т.е. дата добавляется начиная с второй фотографии, у которой одинаковое количество лайков. Как достичь данной логики?! Разумнее функцию main разбить на две функции. В первой вы обрабатываете фотографии с учетом повторения количества лайков и формируете коллекцию, например по вот такому приципу

{
    "1": {
        "size": "z",
        "url": ...
    },
    "7": {
        "size": "w",
        "url": ...
    },
    "1_54235255423": {
        "size": "p",
        "url": ...
    }
}
В второй функции вы производите загрузку фотографий на диск и записываете данные в json файл. Ну и конечно же эти две функции вызываются в функции main

Фотографии должны загружаться в созданную папку. У вас же загрузка происходит в корень диска, что неверно

Нет смысла использовать get, а потом put, если есть сразу готовое решение через метод post

Доработка замечаний №2

В данной части кода
    vk_token = config['VK']['token']
    yandex_token = config['Yandex']['token']
вы достаете токены, но нейминг немного не сходится с тем, что у вас указано в файле settings.ini, из-за чего возникает ошибка

Данную функцию

def upload_photos_to_yandex(results, yandex_disk):
    for likes_count, data in results.items():
        file_name = f"{likes_count}.jpg"
        response = requests.get(data['url'])

        if response.status_code == 200:
            with open(file_name, 'wb') as file:
                file.write(response.content)
            yandex_disk.upload_file(file_name, file_name)
            os.remove(file_name)
необходимо доработать, а именно:

Зачем получать данные файла и потом записывать их в файл локально? это часть здесь лишняя. Локально мы ничего не сохраняем да и данные получать нет смысла, т.к. мы сразу загружаем по ссылке.
метод upload_file принимает три аргумента, но передается только два и причем одинаковых.
Данный метод

    def upload_file(self, file_path, folder_name, file_name):
        upload_url = f'{self.base_url}?path={quote(f"{folder_name}/{file_name}")}&overwrite=true'
        headers = {'Authorization': f'OAuth {self.token}'}
        response = requests.post(upload_url, headers=headers)
        if response.status_code == 201:
            with open(file_path, 'rb') as file:
                requests.put(response.json()['href'], files={'file': file})
        else:
            print(f"Ошибка при получении URL загрузки: {response.json()}")
необходимо доработать, а именно:

Путь можно сразу формировать на основе папки
Не совсем понятно зачем здесь put, если ранее загрузили через post